package com.endofjanuary.placement_example.domain.usecase

import com.endofjanuary.placement_example.domain.repo.ModelsRepo

/*
 Якщо за SRP та Common Closure Principle
 тоді повинно бути 2 usecase для
 завантаженны моделі віддалено з посилання отриманого локально та віддалено просто з переданого URL ?
 */

/*
Або так как 2 методи завантажують модель віддалено треба попередньо
отримувати 2ма способамито посилання та передавати до 1го методу й тоді usecase повинен містити тільки той метод?
*/

/**
 * Тоді де повинні реалізовуватися 2 способи отримання URL ?
 * ( хоча 2й способ просто отримується від моделі одразу )
 */
class LoadModelUseCase(
    private val modelRoomRepo: ModelsRepo,
) {

}

/**
 * Й тоді чи варто уникати зайвого звертання до БД, наприклад, одразу після генерування моделі,
 * коли дані тільки завантажилися до БД та ще до них є доступ,
 * але тоді як перейти на екран відображення ?
 */